Revit 2027 API
BuiltInFailures.AutoJoinFailures.WorksetJoinWarn Property
 Two elements were not automatically joined because one or both is not editable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WorksetJoinWarn { get; }
Public Shared ReadOnly Property WorksetJoinWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WorksetJoinWarn {
	FailureDefinitionId^ get ();
}
static member WorksetJoinWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoJoinFailures Class
Autodesk.Revit.DB Namespace